Catalogs/ЗаявлениеОПроцессуальномПравопреемстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЗаявлениеОПроцессуальномПравопреемстве</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеСуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Суды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрацииДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортныеДанныеДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервоначальногоКредитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеЗаявителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоДела</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтадияДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_ready</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_post</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЮристы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыданПаспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйНомерКредитДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>исх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>вх</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтадияДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СудебноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкротство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесудебноеДелопроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееНазначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорЦессии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДоговорЦессии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СписокДелКредитногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СписокДелКредитногоДоговора</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДела</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтадияДела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженностиПереданная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЗаявлениеОПроцессуальномПравопреемстве/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	
	
		  
	
	
	Если  Параметры.Свойство("ДоговорСтр") Тогда
		      Объект.Владелец=Параметры.ДоговорСтр;
			  Объект.НомерКредитногоДоговора=Параметры.ДоговорСтр.НомерДоговора;
			  Объект.ДатаКредитногоДоговора=Параметры.ДоговорСтр.ДатаФинансирования;
			  
	
	КонецЕсли;
	
	Если  Параметры.Свойство("ДолжникФИО") Тогда
		      Объект.ФИОДолжника=Параметры.ДолжникФИО;
			  
  	КонецЕсли;
	
	
	Если  РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		      Объект.ДатаСоздания=ТекущаяДата();
        	  Объект.Наименование="Заявление о процессуальном правопреемстве";


		     Объект.ДатаРожденияДолжника=Параметры.ДатаРожденияДолжника;
	 
			 Объект.АдресРегистрацииДолжника=Параметры.АдресРегистрацииДолжника;

			 Объект.ПаспортныеДанныеДолжника=Параметры.ПаспортныеДанныеДолжника;
			 
			 Объект.ПаспортДатаВыдачи=Параметры.ПаспортныеДанныеДолжникаДатаВыдачи;
			 Объект.КемВыданПаспорт=Параметры.ПаспортКемВыдан;

			 
			 Объект.МестоРожденияДолжника=Параметры.МестоРожденияДолжника;
			 
			 Объект.НаименованиеПервоначальногоКредитора=Параметры.НаименованиеПервоначальногоКредитора;
			 
			 Объект.НомерДоговораЦессии=Параметры.НомерДоговораЦессии;
			 
			 Объект.ДатаДоговораЦессии=Параметры.ДатаДоговораЦессии;
			 
			 Объект.ТипДокумента=Перечисления.ТипДокумента.исх;
			 
			 Объект.СтадияДокумента=Перечисления.СтадияДокумента.СудебноеПроизводство;
			 
			 Объект.НаименованиеСуда=Параметры.НазваниеСуда;
			 
             Объект.АдресСуда=Параметры.АдресСудаВкладка;
			 
			 Объект.Исполнитель=Параметры.Исполнитель;
			 
			 Объект.НомерСудебногоДела=Параметры.НомерСудебногоДела;
			 
		     Объект.ДатаСудебногоДела=Параметры.ДатаСудебногоДела; 
		   
		     ФИОИсполнителя=Параметры.Исполнитель.ФИО;

			 
			 Объект.ПервоначальныйНомерКредитДоговора=Параметры.ПервоначальныйНомерКредитДоговора;

			 			 
			 
			 
	  Иначе
		  
		   Если   ЗначениеЗаполнено(Объект.НазваниеЗаявителя) Тогда
		          ЮридическийАдресЗаявителя=Объект.НазваниеЗаявителя.ЮридическийАдрес;
	              EmailЗаявителя=Объект.НазваниеЗаявителя.ЭлектронныйАдрес;
	              Телефон=Объект.НазваниеЗаявителя.Телефон;
		   	
		   
		   КонецЕсли;
		     
			 Шаблон=Строка(Объект.ШаблонДляПечати);
			 
		    ФИОИсполнителя=Объект.Исполнитель.ФИО;


		  
      КонецЕсли;
	  
	
		 
	 
	
	
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыНажатие(Элемент)
	
	  Если Не Объект.Ссылка.Пустая() Тогда
		  
		    пармСтр=Новый Структура;
		    пармСтр.Вставить("Владелец",Объект.Ссылка);
		    пармСтр.Вставить("ВладелецФайла",Объект.Ссылка);
			
		    ФормаПрисоедФайлы= ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",пармСтр,Объект.Ссылка);
		  
		  
	  	
	  Иначе 
		  Сообщить("Еще не записан документ, нажмите Записать");
		  
	  КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеЗаявителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	
	 НайтиДанныеПолучателя(ВыбранноеЗначение);

	 
	
КонецПроцедуры

&НаСервере
Процедура НайтиДанныеПолучателя(значпор)

	ЮридическийАдресЗаявителя=значпор.ЮридическийАдрес;
	EmailЗаявителя=значпор.ЭлектронныйАдрес;
	Телефон=значпор.Телефон;
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	  ДвоичныеДанные=ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзХран();

	    Если ДвоичныеДанные<>Неопределено  Тогда
			
			Попытка
			
				
				имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				 MSWord = новый COMОбъект("Word.Application");
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();

				 
				   MSWordDoc.Bookmarks("НаименованиеСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));
				   
				   //АдресСуда
				   MSWordDoc.Bookmarks("АдресСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресСуда);
				   
				   //ФИОДолжника
				   MSWordDoc.Bookmarks("ФИОДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 
					//ДолжникаДатаРождения
	  		       MSWordDoc.Bookmarks("ДолжникаДатаРождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаРожденияДолжника;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
					//ДолжникАдрес
				   MSWordDoc.Bookmarks("ДолжникАдрес").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресРегистрацииДолжника);
				 
                 
					//СудПоле
				   MSWordDoc.Bookmarks("СудПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда)+" ");
				   
				   
				  // НомерДелаВСуде
				   MSWordDoc.Bookmarks("НомерДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
				   
				   //ПервоначальныйКредитор
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				 
				   
				   //ФИОДолжникПоле
				   MSWordDoc.Bookmarks("ФИОДолжникПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 
				   //НомерКредитногоДоговора
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   
				   //ДатаКредитногоДоговора
				   MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
					
				   //ПервоначальныйКредитор_Между
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеПервоначальногоКредитора)+" ");

				   
				   //НомерЦессии
				   MSWordDoc.Bookmarks("НомерЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				 

				   //ДатаЦессии
				    MSWordDoc.Bookmarks("ДатаЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
				   
					//НомерКредитногоДоговора_Между
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   
				   //ДатаКредитногоДоговора_Между
				    MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				  
				   
				   //ПервоначальныйКредитор_М_между
				     MSWordDoc.Bookmarks("ПервоначальныйКредитор_М_между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   //ФИОДолжника_Между
				     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 

				   //НомерЦессии_Переход
				    MSWordDoc.Bookmarks("НомерЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   //ДатаЦессии_Переход
				     MSWordDoc.Bookmarks("ДатаЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				
				   
				   //ПервоначальныйКредитор_Также
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Также").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   //НомерДелаВСуде_Прошу
				   MSWordDoc.Bookmarks("НомерДелаВСуде_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
				   
				   //ДатаДелаВСуде
				   MSWordDoc.Bookmarks("ДатаДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаСудебногоДела;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
				   //ДатаДелаВСуде_1
				   MSWordDoc.Bookmarks("ДатаДелаВСуде_1").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаСудебногоДела;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   


				   //ПервоначальныйКредитор_Прошу
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   //ФИОДолжника_Прошу
				   MSWordDoc.Bookmarks("ФИОДолжника_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));

				   
				   //НомерКредитногоДоговора_Прошу
				     MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   //ДатаКредитногоДоговора_Прошу
				      MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
				   MSWordDoc.Application.Selection.TypeText(дат);
				  
				   
				   //ПервоначальныйКредитор_Прошу_2
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу_2").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   
				   //НомерЦессии_Приложение
				   MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   
				   //ДатаЦессии_Приложение
				        MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				

				   //НомерЦессии_Приложение_Выписка
				     MSWordDoc.Bookmarks("НомерЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   
				   //ДатаЦессии_Приложение_Выписка
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				

				   //ДатаЗаявления
				     MSWordDoc.Bookmarks("ДатаЗаявления").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=ТекущаяДата();
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   
				  MSWord.Visible=1;
				  MSWord.Activate();

				  
				  
				  
				  
			
			Исключение
				
				Сообщить("Ошибка----- Печать Заявление О Процессуальном Правопреемстве");
				ТекстОшибки = ОписаниеОшибки();
				Сообщить(ТекстОшибки);

				
				
			КонецПопытки;
			
			
		КонецЕсли;	
	
	
	
КонецПроцедуры



&НаСервере
Функция ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзСправочника(ссылкаСпр)

	      Двоичные=Неопределено;

	       Хран=ссылкаСпр.ФайлШаблона;
        	Двоичные=Хран.Получить(); 

	       Возврат Двоичные;	
	
КонецФункции // ()

 
&НаСервере
Функция ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзХран()
	
	   Двоичные=Неопределено;
	  Если Не ЗначениеЗаполнено(Объект.ШаблонДляПечати) Тогда
		  
		    НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОПроцессуальномПравопреемстве",ИСТИНА);
	 
	     
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 

	  	
	  
	  Иначе
	  
		                об=Объект.ШаблонДляПечати;
						
		    	   		Хран=об.ФайлШаблона;
		        		Двоичные=Хран.Получить(); 

		  
	  
	  КонецЕсли;
	
	
	     	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()

&НаСервере
Функция ПолучитьФайлВыпискаИзРеестраХран()
	
	 
	   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонВыпискиИзРеестра",ИСТИНА);
	 
	     Двоичные=Неопределено;
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()



  
  

&НаКлиенте
Процедура is_readyПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	Если Объект.is_ready Тогда
		
		
		 //  Очистит присоединенные файлы
		 массивСтруктур= ПолучитьПрисоединенныеФайлы(Объект.Ссылка);
		 
		 Для каждого стрФайл  Из массивСтруктур Цикл
			 
			  строкаПуть= ПолучитьПутьКФайлу(стрФайл);
			 Попытка
				 
				 
			  ВыбФайл = Новый Файл(строкаПуть);	 
			  Если ВыбФайл.Существует() Тогда 
			    Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
			        ВыбФайл.УстановитьТолькоЧтение(Ложь);
			    КонецЕсли;
			    УдалитьФайлы(строкаПуть);                       
			 КонецЕсли;
							 
			

			  УдалитьИзСправочникаФайл(стрФайл);
			  
			 
			 Исключение
				 
				 ТекстОшибки = ОписаниеОшибки();
				 Сообщить(ТекстОшибки);
				 
			 КонецПопытки;
			 
					 	
		 
		 КонецЦикла;
		 
		 

	     
	   
	     файлСтр= СформироватьФайлЗаявлениеОПроцессуальномПравопреемстве();
		 
		 Если файлСтр.Количество()<>0 Тогда
			 
			  записатьВХранилищеЗаявлениеОПроцессуальномПравопреемстве(файлСтр);

		 
		 КонецЕсли;
	     
	    

	     файлВыписка=СформироватьФайлВыпискаИзРеестра(Объект.Владелец);
	     
	     
	     записатьВХранилищеВыпискаИзРеестра(файлВыписка);
		 
		 Оповестить("ОбновитьСписок1");
		 
				
		 Сообщить("Ок");
		
	КонецЕсли;
	
	 	
КонецПроцедуры


&НаСервере
Функция ПолучитьПутьКФайлу(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			   
			Возврат  об.Том.ПолныйПутьWindows+ об.ПутьКФайлу;

КонецФункции // ()


&НаСервере
Процедура УдалитьИзСправочникаФайл(ссылкаНаФайл)

	        об=ссылкаНаФайл.ПолучитьОбъект();
			
			
			об.Удалить();
			   
			

КонецПроцедуры	







&НаСервере
Функция ПолучитьПрисоединенныеФайлы(владелецФайлов)

		//структураФайлы=Новый Структура;

		массивСтруктур=Новый Массив;
		
	
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОФайлах.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
		|ГДЕ
		|	СведенияОФайлах.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", владелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи

		//структураФайлы.Вставить("Файл", ВыборкаДетальныеЗаписи.Файл);
		массивСтруктур.Добавить(ВыборкаДетальныеЗаписи.Файл);

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	 //ВыборкаДетальныеЗаписи.Файл.ПутьКФайлу
	
	
	 Возврат массивСтруктур;

КонецФункции // ()



&НаСервере
Процедура записатьВХранилищеВыпискаИзРеестра(файлВыписка)

          имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";

	
	      адресВХранилище = ПоместитьВоВременноеХранилище(файлВыписка.ДвоичныеДанные);
        
          ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(Объект.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		  УдалитьФайлы(файлВыписка.ИмяФайла);

	

КонецПроцедуры


&НаСервере
Процедура записатьВХранилищеЗаявлениеОПроцессуальномПравопреемстве (стрФайл)

	      имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";

	  
		  	    адресВХранилище = ПоместитьВоВременноеХранилище(стрФайл.ДвоичныеДанные);
        
                ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(Объект.Ссылка,имяД,"docx",,,адресВХранилище);
		  
		        УдалитьФайлы(стрФайл.ИмяФайла);

	
	    
	

КонецПроцедуры



&НаСервере
Функция ПолучитьДанныеДляВыпискиИзРеестра(дог)

	     структДанных=Новый Структура;
	
	
	              //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДанныеДоговоровСрезПоследних.ПросроченныйОсновнойДолг КАК ПросроченныйОсновнойДолг,
					|	ДанныеДоговоровСрезПоследних.ПросроченныеПроценты КАК ПросроченныеПроценты,
					|	ДанныеДоговоровСрезПоследних.ТекущиеПроценты КАК ТекущиеПроценты,
					|	ДанныеДоговоровСрезПоследних.Госпошлина КАК Госпошлина,
					|	ДанныеДоговоровСрезПоследних.Неустойка КАК Неустойка,
					|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность
					|ИЗ
					|	РегистрСведений.ДанныеДоговоров.СрезПоследних КАК ДанныеДоговоровСрезПоследних
					|ГДЕ
					|	ДанныеДоговоровСрезПоследних.Договор = &Договор";
				
				Запрос.УстановитьПараметр("Договор", дог);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоОсновнДолг",ВыборкаДетальныеЗаписи.ПросроченныйОсновнойДолг);
					
					структДанных.Вставить("ОстатокПросроченнойЗадПоПроцентам",0);
					
					структДанных.Вставить("СуммаПросроченнойКомиссии",0);
					структДанных.Вставить("ШтрафыИНеустойки",ВыборкаДетальныеЗаписи.Неустойка);
					
					структДанных.Вставить("СуммаПроцНаПросрочЗадолж",ВыборкаДетальныеЗаписи.ПросроченныеПроценты);
					
					структДанных.Вставить("Госпошлина",ВыборкаДетальныеЗаписи.Госпошлина);
					
					структДанных.Вставить("Итого",ВыборкаДетальныеЗаписи.ВсегоЗадолженность);
					
					
					
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорЦессии.НомерДоговора КАК НомерЦессии,
		|	ДоговорЦессии.ДатаЦессии КАК ДатаЦессии,
		|	Договоры.НомерДоговора КАК НомерДоговора,
		|	Договоры.Владелец КАК Владелец,
		|	Договоры.Владелец.ДатаРождения КАК ВладелецДатаРождения,
		|	Договоры.ДатаФинансирования КАК ДатаФинансирования
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорЦессии КАК ДоговорЦессии
		|		ПО (ДоговорЦессии.Владелец = Договоры.Ссылка)
		|ГДЕ
		|	Договоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", дог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		структДанных.Вставить("ЦессияДата_заголовок",ВыборкаДетальныеЗаписи.ДатаЦессии);
		структДанных.Вставить("Дата_Рождения",ВыборкаДетальныеЗаписи.ВладелецДатаРождения);
		структДанных.Вставить("ФИО_Должник",ВыборкаДетальныеЗаписи.Владелец);
		структДанных.Вставить("НомерКредитногоДоговора",ВыборкаДетальныеЗаписи.НомерДоговора);
		структДанных.Вставить("Дата_ВыдачиКредитногоДоговора",ВыборкаДетальныеЗаписи.ДатаФинансирования);
		
		
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//структДанных.Вставить("Цессия_заголовок",ВыборкаДетальныеЗаписи.НомерЦессии);
		//
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	  	Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	СписокДелКредитногоДоговора.НомерДела КАК НомерДела,
						|	СписокДелКредитногоДоговора.ДатаДела КАК ДатаДела,
						|	СписокДелКредитногоДоговора.СтадияДела КАК СтадияДела,
						|	СписокДелКредитногоДоговора.НомерЦессии КАК НомерЦессии,
						|	СписокДелКредитногоДоговора.ДатаЦессии КАК ДатаЦессии
						|ИЗ
						|	Справочник.СписокДелКредитногоДоговора КАК СписокДелКредитногоДоговора
						|ГДЕ
						|	СписокДелКредитногоДоговора.Владелец = &Владелец
						|
						|УПОРЯДОЧИТЬ ПО
						|	ДатаДела УБЫВ";
					
					Запрос.УстановитьПараметр("Владелец", дог);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					      Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						      структДанных.Вставить("НомерДела",ВыборкаДетальныеЗаписи.НомерДела);
                              структДанных.Вставить("ДатаДела",ВыборкаДетальныеЗаписи.ДатаДела);
							  
							  структДанных.Вставить("СтадияДокумента",ВыборкаДетальныеЗаписи.СтадияДела);
							  
							  структДанных.Вставить("НомерЦессииИзДела",ВыборкаДетальныеЗаписи.НомерЦессии);
                              структДанных.Вставить("ДатаЦессииИзДела",ВыборкаДетальныеЗаписи.ДатаЦессии);
							  
							  
							  
						
						  КонецЦикла;
					Иначе	  
                             структДанных.Вставить("НомерДела","");
                             структДанных.Вставить("ДатаДела",'00010101');
						     структДанных.Вставить("СтадияДокумента",Перечисления.СтадияДокумента.СудебноеПроизводство);
							  структДанных.Вставить("НомерЦессииИзДела","");
                              структДанных.Вставить("ДатаЦессииИзДела",'00010101');
						
					
					КонецЕсли;

	
	

	

     структДанных.Вставить("Исполнитель",Объект.Исполнитель);
				
	
	
	
   Возврат 	структДанных;
  
				
КонецФункции // ()



&НаКлиенте
Функция СформироватьФайлВыпискаИзРеестра(дог)
	
	      спрОбСтруктура=ПолучитьДанныеДляВыпискиИзРеестра(дог);
		  
		  НомерЦессии="";
		  ДатаЦессии='00010101';
		  
		  Если спрОбСтруктура.Цессия_заголовок=null Тогда
		  
		   	    НомерЦессии=спрОбСтруктура.НомерЦессииИзДела;
		        ДатаЦессии=спрОбСтруктура.ДатаЦессииИзДела;
		  	
		  
		  Иначе
		  
		  	    НомерЦессии=спрОбСтруктура.Цессия_заголовок;
		        ДатаЦессии=спрОбСтруктура.ЦессияДата_заголовок;
		  
		  
		  КонецЕсли;

		  
		  
	
	      ДвоичныеДанные=ПолучитьФайлВыпискаИзРеестраХран();
			 
		  файлСтруктура=Новый Структура;
			 
		  Если ДвоичныеДанные<>Неопределено  Тогда
			  
			 MSWord = новый COMОбъект("Word.Application"); 
			  
			 Попытка
			
				
				имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);

				
				 
					 //Передаем текущие параметры форм в MSWord
					 MSWord.Documents.Open(ИмяФайла);	
					 MSWordDoc = MSWord.ActiveDocument();

					 
					  MSWordDoc.Bookmarks("Цессия_заголовок").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  
					   //ЦессияДата_заголовок
				    MSWordDoc.Bookmarks("ЦессияДата_заголовок").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датЦессия=ДатаЦессии;
				   дат= Формат(датЦессия, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				    //Дата_Рождения
				    MSWordDoc.Bookmarks("Дата_Рождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=спрОбСтруктура.Дата_Рождения;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   //Цессия_Название
					  MSWordDoc.Bookmarks("Цессия_Название").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(НомерЦессии));

					  //ЦессияДата_Название
				         MSWordDoc.Bookmarks("ЦессияДата_Название").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=ДатаЦессии;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					 // ФИО_Должник
					   MSWordDoc.Bookmarks("ФИО_Должник").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ФИО_Должник));

					  //НомерКредитногоДоговора
					    MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.НомерКредитногоДоговора));

					   
					  //Дата_ВыдачиКредитногоДоговора
					       MSWordDoc.Bookmarks("Дата_ВыдачиКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=спрОбСтруктура.Дата_ВыдачиКредитногоДоговора;
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);

					   
					   //ОстатокПросроченнойЗадПоОсновнДолг
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоОсновнДолг").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоОсновнДолг));

					  
					  //ОстатокПросроченнойЗадПоПроцентам
					  MSWordDoc.Bookmarks("ОстатокПросроченнойЗадПоПроцентам").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ОстатокПросроченнойЗадПоПроцентам));

					  
					  //СуммаПросроченнойКомиссии
					    MSWordDoc.Bookmarks("СуммаПросроченнойКомиссии").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПросроченнойКомиссии));

					   //ШтрафыИНеустойки
					   MSWordDoc.Bookmarks("ШтрафыИНеустойки").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.ШтрафыИНеустойки));

					  //СуммаПроцНаПросрочЗадолж
					    MSWordDoc.Bookmarks("СуммаПроцНаПросрочЗадолж").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.СуммаПроцНаПросрочЗадолж));

					  
					  //Госпошлина
					     MSWordDoc.Bookmarks("Госпошлина").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Госпошлина));

					  //Итого
					        MSWordDoc.Bookmarks("Итого").Select();
			    	  MSWordDoc.Application.Selection.Font.Color = 1;
                      MSWordDoc.Application.Selection.TypeText(Строка(спрОбСтруктура.Итого));

					  
						 //Дата_подвал
					 Если  MSWordDoc.Bookmarks.Exists("Дата_подвал")  Тогда	 
					   MSWordDoc.Bookmarks("Дата_подвал").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датЦессия=ТекущаяДата();
					   дат= Формат(датЦессия, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
                     КонецЕсли;
					   
					 
					 //ФИОСотрудника
					 
                      Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
					   MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   //MSWordDoc.Application.Selection.TypeText(ФИОИсполнителя);
					   
					   Для каждого  обвк Из  MSWordDoc.Application.Selection.Bookmarks Цикл
						   
						   обвк.Range.Text= Строка(ФИОИсполнителя);
							  
					   
					   КонецЦикла;
					   
					   
						//ПодписьПр
					   
					 
					   
					   
					  КонецЕсли;
					
					
					  
					  
 
					 
					 
					 
					     MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(Объект.Исполнитель)+"_ВыпискаИзРеестра";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
					MSWordDoc.Close(0);
					MSWord.Application.Quit();
			
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
				
				
				
				
				
			
			Исключение
				
				   MSWord.Application.Quit();
 
				   Сообщить("Ошибка-----  Выписки из реестра");
				   ТекстОшибки = ОписаниеОшибки();
				   Сообщить(ТекстОшибки);

				
			КонецПопытки;  
			  
			  
		  КонецЕсли;	  
		  
	 
	    Возврат файлСтруктура;
	

КонецФункции // ()



&НаСервере
Функция АдресБанка(дог)

	адресБ="";
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Банк.Адрес КАК БанкАдрес
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", дог);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				адресБ=ВыборкаДетальныеЗаписи.БанкАдрес;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	
	 Возврат  адресБ;
	

КонецФункции // ()



&НаКлиенте
Функция СформироватьФайлЗаявлениеОПроцессуальномПравопреемстве()
	
	
	  	  
		  
	         ДвоичныеДанные=ПолучитьФайлЗаявлениеОПроцессуальномПравопреемствеИзХран();
			 
			 файлСтруктура=Новый Структура;
			 
			 

	    Если ДвоичныеДанные<>Неопределено  Тогда
			
			 MSWord = новый COMОбъект("Word.Application");

			
			Попытка
			
				
				имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				//Selection.InsertFile
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				 
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();
				

				  Если  MSWordDoc.Bookmarks.Exists("НаименованиеСуда")  Тогда
				   MSWordDoc.Bookmarks("НаименованиеСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));
			     КонецЕсли;
			   
				   //АдресСуда
				   Если  MSWordDoc.Bookmarks.Exists("АдресСуда")  Тогда
					   MSWordDoc.Bookmarks("АдресСуда").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.АдресСуда);
				   КонецЕсли;
				   
				   
				   //ФИОДолжника
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника")  Тогда
					   MSWordDoc.Bookmarks("ФИОДолжника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
					КонецЕсли;   
					   
					//ДолжникаДатаРождения
					Если  MSWordDoc.Bookmarks.Exists("ДолжникаДатаРождения")  Тогда
		  		       MSWordDoc.Bookmarks("ДолжникаДатаРождения").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаРожденияДолжника;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					 КонецЕсли;  
					 
					 //////////////
					 
					 //МестоРожденияДолжника
					Если  MSWordDoc.Bookmarks.Exists("МестоРожденияДолжника")  Тогда
					   MSWordDoc.Bookmarks("МестоРожденияДолжника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.МестоРожденияДолжника));
					КонецЕсли;  
					 
					
					//ПаспортНомер
					Если  MSWordDoc.Bookmarks.Exists("ПаспортНомер")  Тогда
					   MSWordDoc.Bookmarks("ПаспортНомер").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ПаспортныеДанныеДолжника));
					КонецЕсли;  

					// ПаспортДатаВыдачи
					Если  MSWordDoc.Bookmarks.Exists("ПаспортДатаВыдачи")  Тогда
		  		       MSWordDoc.Bookmarks("ПаспортДатаВыдачи").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ПаспортДатаВыдачи;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					 КонецЕсли;  
					
					 
					 // КемВыдан
					 Если  MSWordDoc.Bookmarks.Exists("КемВыдан")  Тогда
					   MSWordDoc.Bookmarks("КемВыдан").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.КемВыданПаспорт));
					КонецЕсли;  

					// ПервоначальныйКредиторЗаголовок
					 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторЗаголовок")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторЗаголовок").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   

					
					// ПервоначальныйКредиторАдресЗагол
					 Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторАдресЗагол")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторАдресЗагол").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(АдресБанка(Объект.Владелец)+" ");
					КонецЕсли;   

					
					// НомерДелаЗаголовок
					  Если  MSWordDoc.Bookmarks.Exists("НомерДелаЗаголовок")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаЗаголовок").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела+" ");
					КонецЕсли;   

					//НаименованиеСудаВынес
					  Если  MSWordDoc.Bookmarks.Exists("НаименованиеСудаВынес")  Тогда
					   MSWordDoc.Bookmarks("НаименованиеСудаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));
				     КонецЕсли;

					
					 // НомерДелаВынес
					  Если  MSWordDoc.Bookmarks.Exists("НомерДелаВынес")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НомерСудебногоДела));
				     КонецЕсли;

					 
					 // ДатаДелаВынес
					 Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВынес")  Тогда
		  		       MSWordDoc.Bookmarks("ДатаДелаВынес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаСудебногоДела;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					 КонецЕсли;  
					

					 //ПервоначальныйКредиторУдовлетвор
					  Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредиторУдовлетвор")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредиторУдовлетвор").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли; 
					 
					 
					// ФИОДОЛЖНИКУдовлет
					Если  MSWordDoc.Bookmarks.Exists("ФИОДОЛЖНИКУдовлет")  Тогда
					   MSWordDoc.Bookmarks("ФИОДОЛЖНИКУдовлет").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
					КонецЕсли;
									 
					   
					   // ФИОСотрудника
					  Если  MSWordDoc.Bookmarks.Exists("ФИОСотрудника")  Тогда
					   MSWordDoc.Bookmarks("ФИОСотрудника").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   //MSWordDoc.Application.Selection.TypeText(ФИОИсполнителя);
					   
					   Для каждого  обвк Из  MSWordDoc.Application.Selection.Bookmarks Цикл
						   
						   обвк.Range.Text= Строка(ФИОИсполнителя);
					   
					   КонецЦикла;
					   
					   
					 КонецЕсли;

					 
					 
					 
					 
					 
					 
					 
					 
					//ДолжникАдрес
					Если  MSWordDoc.Bookmarks.Exists("ДолжникАдрес")  Тогда
					   MSWordDoc.Bookmarks("ДолжникАдрес").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
                       MSWordDoc.Application.Selection.TypeText(Объект.АдресРегистрацииДолжника);
				     КонецЕсли;
                 
					//СудПоле
					Если  MSWordDoc.Bookmarks.Exists("СудПоле")  Тогда
						   MSWordDoc.Bookmarks("СудПоле").Select();
						   MSWordDoc.Application.Selection.Font.Color = 1;
		                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда)+" ");
				     КонецЕсли;
				   
				  // НомерДелаВСуде
				  Если  MSWordDoc.Bookmarks.Exists("НомерДелаВСуде")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаВСуде").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
					КонецЕсли;   
					   
				   //ПервоначальныйКредитор
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   
					   
				   
				   //ФИОДолжникПоле
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжникПоле")  Тогда
					   MSWordDoc.Bookmarks("ФИОДолжникПоле").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
					КонецЕсли;   
					   
				   //НомерКредитногоДоговора
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора")  Тогда
					   MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
					КонецЕсли;   
					
					
					
		////////////
					
					
					//ПервоначальныйНомерКредитногоДоговора
					Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйНомерКредитногоДоговора")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйНомерКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора);
					КонецЕсли;   
					
					//Номер0КредитногоДоговора_Прошу
					 Если  MSWordDoc.Bookmarks.Exists("Номер0КредитногоДоговора_Прошу")  Тогда
					   MSWordDoc.Bookmarks("Номер0КредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.ПервоначальныйНомерКредитДоговора);
					КонецЕсли;   

					
					
					
					
					//ПервоначальныйКредитор_былиизм
					
				    Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_былиизм")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредитор_былиизм").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   

					
					//НомерКредитногоДоговора_былизм
					Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_былизм")  Тогда
					   MSWordDoc.Bookmarks("НомерКредитногоДоговора_былизм").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
					КонецЕсли;   
					
			            		
					//ДатаКредитногоДоговора_былиз
					Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_былиз")  Тогда
					   MSWordDoc.Bookmarks("ДатаКредитногоДоговора_былиз").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;

					
					
					
					
					
	 ////////////
					
					
					
				   //ДатаКредитногоДоговора
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора")  Тогда
					   MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;
					
				   //ПервоначальныйКредитор_Между
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Между")  Тогда
					    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеПервоначальногоКредитора)+" ");
                    КонецЕсли;  
					   
				   
				   //НомерЦессии
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии")  Тогда
					   MSWordDoc.Bookmarks("НомерЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				   КонецЕсли;

				   //ДатаЦессии
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии")  Тогда
					    MSWordDoc.Bookmarks("ДатаЦессии").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;
				   
					//НомерКредитногоДоговора_Между
					Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Между")  Тогда
					   MSWordDoc.Bookmarks("НомерКредитногоДоговора_Между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				     КонецЕсли;
				   
				   //ДатаКредитногоДоговора_Между
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Между")  Тогда
					    MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;
				   
				   //ПервоначальныйКредитор_М_между
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_М_между")  Тогда
					     MSWordDoc.Bookmarks("ПервоначальныйКредитор_М_между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
                    КонецЕсли;
					   
				   
				   //ФИОДолжника_Между
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Между")  Тогда
					     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
					 КонецЕсли;  
					   

				   //НомерЦессии_Переход
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Переход")  Тогда
					    MSWordDoc.Bookmarks("НомерЦессии_Переход").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
                    КонецЕсли;
					   
				   //ДатаЦессии_Переход
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Переход")  Тогда
					     MSWordDoc.Bookmarks("ДатаЦессии_Переход").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				    КонецЕсли;
				   
				   //ПервоначальныйКредитор_Также
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Также")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Также").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   

				   //НомерДелаВСуде_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("НомерДелаВСуде_Прошу")  Тогда
					   MSWordDoc.Bookmarks("НомерДелаВСуде_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
					КонецЕсли;   
					   
				   
				   //ДатаДелаВСуде
				   Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВСуде")  Тогда
					   MSWordDoc.Bookmarks("ДатаДелаВСуде").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаСудебногоДела;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;   
				   
				   
				   //ДатаДелаВСуде_1
				   Если  MSWordDoc.Bookmarks.Exists("ДатаДелаВСуде_1")  Тогда
					   MSWordDoc.Bookmarks("ДатаДелаВСуде_1").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаСудебногоДела;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   MSWordDoc.Application.Selection.TypeText(дат);
				КонецЕсли;	   
				   
				   


				   //ПервоначальныйКредитор_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу")  Тогда
					   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   

				   
				   //ФИОДолжника_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ФИОДолжника_Прошу")  Тогда
					   MSWordDoc.Bookmarks("ФИОДолжника_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				   КонецЕсли;	   

				   
				   //НомерКредитногоДоговора_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("НомерКредитногоДоговора_Прошу")  Тогда
					     MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				  КонецЕсли;	   
					   
				 
				   //ДатаКредитногоДоговора_Прошу
				   Если  MSWordDoc.Bookmarks.Exists("ДатаКредитногоДоговора_Прошу")  Тогда
					      MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаКредитногоДоговора;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   длина=СтрДлина(дат);
					   дат=Лев(дат,длина-2);
					   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;   
				  
				   
				   //ПервоначальныйКредитор_Прошу_2
				   Если  MSWordDoc.Bookmarks.Exists("ПервоначальныйКредитор_Прошу_2")  Тогда
					    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу_2").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
					КонецЕсли;   

				   
				   
				   //НомерЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение")  Тогда
					   MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
					КонецЕсли;   

				   
				   //ДатаЦессии_Приложение
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение")  Тогда
					        MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   длина=СтрДлина(дат);
					   дат=Лев(дат,длина-2);
	                   MSWordDoc.Application.Selection.TypeText(дат);
					 КонецЕсли;  
				

				   //НомерЦессии_Приложение_Выписка
				   Если  MSWordDoc.Bookmarks.Exists("НомерЦессии_Приложение_Выписка")  Тогда
					     MSWordDoc.Bookmarks("НомерЦессии_Приложение_Выписка").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
	                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
					КонецЕсли;   

				   
				   //ДатаЦессии_Приложение_Выписка
				   Если  MSWordDoc.Bookmarks.Exists("ДатаЦессии_Приложение_Выписка")  Тогда
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение_Выписка").Select();
					   MSWordDoc.Application.Selection.Font.Color = 1;
					   датРож=Объект.ДатаДоговораЦессии;
					   дат= Формат(датРож, "ДЛФ=ДД");
					   длина=СтрДлина(дат);
					   дат=Лев(дат,длина-2);
	                   MSWordDoc.Application.Selection.TypeText(дат);
					КонецЕсли;   
				

				  // //ДатаЗаявления
				  // Если  MSWordDoc.Bookmarks.Exists("АдресСуда")  Тогда
				  //       MSWordDoc.Bookmarks("ДатаЗаявления").Select();
				  //     MSWordDoc.Application.Selection.Font.Color = 1;
				  //     датРож=ТекущаяДата();
				  //     дат= Формат(датРож, "ДЛФ=ДД");
				  //     MSWordDoc.Application.Selection.TypeText(дат);
				  //КонецЕсли;	   

				   
				    MSWord.Visible=0;
						
						//MSWord.Activate();
						
					//ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".pdf";
					
					
				      имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";

				 
				      ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				     	
				    	ВыбранныйФайл = Новый Файл(ИмяФайла);
				    	Если ВыбранныйФайл.Существует() Тогда
				    		
				    		УдалитьФайлы(ВыбранныйФайл);
				    		
				    	
				    	КонецЕсли; 

							

						
					MSWordDoc.SaveAs(ИмяФайла,16);
					
					MSWordDoc.Close(0);
						
						
						
					MSWord.Application.Quit();

					
					двФайл = Новый ДвоичныеДанные(ИмяФайла);
					
					файлСтруктура.Вставить("ДвоичныеДанные",двФайл);
					файлСтруктура.Вставить("ИмяФайла",ИмяФайла);
					
					
					ВыбранныйФайл = Новый Файл(ИмяФайла);
					Если ВыбранныйФайл.Существует() Тогда
						
						УдалитьФайлы(ВыбранныйФайл);
						
					
					КонецЕсли; 

					
					
					
					
				   
				  //MSWord.Visible=1;
				  //MSWord.Activate();

				  //
				  //
				 
				  
			
			Исключение
				
				MSWord.Application.Quit();

				
				Сообщить("Ошибка----- Заявление О Процессуальном Правопреемстве");
				ТекстОшибки = ОписаниеОшибки();
				Сообщить(ТекстОшибки);

				
				
			КонецПопытки;
			
			
		

		  
	  
	  КонецЕсли;
	
	   
		
	

	  Возврат файлСтруктура; 
	
	

КонецФункции // ()




&НаСервере
Функция ПолучитьСсылкуНаФайл()
	
	 структураФайлы=Новый Структура;
	
	
	         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОФайлах.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
		|ГДЕ
		|	СведенияОФайлах.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		структураФайлы.Вставить("Файл", ВыборкаДетальныеЗаписи.Файл);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	 Возврат структураФайлы;

 КонецФункции // ()
 

&НаКлиенте
Процедура НаименованиеСудаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	 
	 
	
	 Объект.АдресСуда=АдресСуда(ВыбранноеЗначение); 
	
КонецПроцедуры

&НаСервере
Функция АдресСуда(СсылкаСуд)
	
	 справСуды=СсылкаСуд.ПолучитьОбъект();
	 
	 Возврат  справСуды.Адрес;

КонецФункции // ()



&НаКлиенте
Процедура ДанныеПоиска(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия= Неопределено Тогда
	     Возврат;
		
	
	 Иначе
 
	   Объект.ШаблонДляПечати=РезультатЗакрытия;
	   Шаблон=Строка(РезультатЗакрытия);
		 
		 
     КонецЕсли;
 

КонецПроцедуры

&НаКлиенте
Процедура ШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	     СтандартнаяОбработка=Ложь;
	
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеПоиска",ЭтотОбъект);
	
	 ОткрытьФорму("Справочник.ШаблоныЗаявлениеОПроцессуальномПравопреемстве.Форма.ФормаВыбораПростая",,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры
